Repository: alexsave/foolish
Catalog: ios/FoolishKit/Localizable.xcstrings
Source language: en
Languages: ko, ru

source: About
ko: 소개
ru: О нас

source: About FOOLISH
ko: FOOLISH 소개
ru: О ДУРАЦКИЙ

source: Add Bot
ko: 봇 추가
ru: Добавить бота

# add_bot_named
source: Add {name}
ko: {name} 추가
ru: Добавить {name}

source: Attack
ko: 공격
ru: Подкидываю

source: Back to Home
ko: 홈으로 돌아가기
ru: Вернуться на главную

source: Chat
ko: 채팅
ru: Чат

# click_to_edit
source: Click to edit game name
ko: 클릭하여 게임 이름 수정
ru: Нажмите, чтобы изменить название игры

source: Continue to Lobby
ko: 로비로 이동
ru: Продолжить в лобби

source: Copied!
ko: 복사됨!
ru: Скопировано!

source: Copy code
ko: 코드 복사
ru: Скопировать код

source: Cover
ko: 방어
ru: Крою

source: Create New Game
ko: 새 게임 만들기
ru: Создать новую игру

source: Dashboard
ko: 대시보드
ru: Главная

# dashboard_title
source: {username}'s Dashboard
ko: {username}의 대시보드
ru: Главная {username}

# deck_cards
source: Cards in deck
ko: 덱 카드 수
ru: Карт в колоде

source: Defender
ko: 수비자
ru: Отбивающийся

source: discarded
ko: 버림
ru: бито

source: draws
ko: 뽑기
ru: берёт

# enter_game_id
source: Enter existing game ID
ko: 기존 게임 ID 입력
ru: Введите ID игры

source: Exit Game
ko: 게임 나가기
ru: Выйти из игры

source: Final Rankings
ko: 최종 순위
ru: Итоговые результаты

source: First Attacker
ko: 선공
ru: Заходящий

source: FOOLISH
ko: 바보같은
ru: ДУРАЦКИЙ

source: Game Over
ko: 게임 종료
ru: Игра окончена

# games_label
source: Games
ko: 게임 수
ru: Игры

source: Good
ko: 방어 완료
ru: Бито

# hide_cards
source: Hide hands
ko: 패 숨기기
ru: Скрыть карты

# invalid_replay
source: This replay link is invalid
ko: 이 리플레이 링크가 잘못되었습니다
ru: Эта ссылка на повтор недействительна

source: is out
ko: 탈락
ru: вышел

source: is the fool
ko: 바보입니다
ru: — дурак

source: Join
ko: 참가
ru: Присоединиться

source: Join Game
ko: 게임 참가
ru: Присоединиться к игре

source: Leaderboard
ko: 리더보드
ru: Таблица лидеров

# load_failed
source: Could not load — try again later
ko: 불러오지 못했습니다. 나중에 다시 시도하세요
ru: Не удалось загрузить — попробуйте позже

source: Loading...
ko: 로딩 중...
ru: Загрузка...

source: Login
ko: 로그인
ru: Войти

source: Login failed
ko: 로그인 실패
ru: Не удалось войти

source: Match History
ko: 경기 기록
ru: История игр

# no_games_available
source: No games available. Create a new game to get started!
ko: 사용 가능한 게임이 없습니다. 새 게임을 만들어 시작하세요!
ru: Нет доступных игр. Создайте новую игру, чтобы начать!

# no_match_history
source: No recorded games yet. Games you finish will show up here with a replay.
ko: 아직 기록된 게임이 없습니다. 완료한 게임이 리플레이와 함께 여기에 표시됩니다.
ru: Пока нет записанных игр. Завершённые партии появятся здесь с повтором.

# no_ranked_players
source: No rated players yet — finish a game to appear here.
ko: 아직 랭킹에 오른 플레이어가 없습니다. 게임을 끝내면 여기에 표시됩니다.
ru: Пока нет игроков с рейтингом — доиграйте партию, чтобы попасть сюда.

# oracle_analyzing
source: Analyzing… {n} worlds · {rate}/s
ko: 분석 중… {n}개 월드 · 초당 {rate}
ru: Анализ… {n} миров · {rate}/с

# oracle_approx
source: Approximate position (some hidden cards inferred).
ko: 근사 포지션 (일부 숨겨진 카드는 추론됨).
ru: Приблизительная позиция (часть скрытых карт выведена).

# oracle_basis
source: Based on the publicly visible record.
ko: 공개된 기록을 기반으로 함.
ru: На основе публично видимой записи.

# oracle_best
source: best
ko: 최선
ru: лучший

# oracle_button_title
source: Oracle: move strength
ko: 오라클: 수의 강도
ru: Оракул: сила хода

# oracle_class_best
source: best
ko: 최선
ru: лучший

# oracle_class_blunder
source: blunder
ko: 대실수
ru: грубая ошибка

# oracle_class_excellent
source: excellent
ko: 훌륭함
ru: отличный

# oracle_class_good
source: good
ko: 좋음
ru: хороший

# oracle_class_inaccuracy
source: inaccuracy
ko: 부정확
ru: неточность

# oracle_class_mistake
source: mistake
ko: 실수
ru: ошибка

# oracle_converged
source: Converged
ko: 수렴됨
ru: Сошлось

# oracle_ef_tip
source: Expected finishing place over the sampled worlds (lower is better).
ko: 표본 월드에서의 예상 순위 (낮을수록 좋음).
ru: Ожидаемое место в сыгранных мирах (меньше — лучше).

# oracle_exact
source: Exact (solved)
ko: 정확 (풀이됨)
ru: Точно (решено)

# oracle_forced_loss
source: proven loss
ko: 증명된 패배
ru: доказанный проигрыш

# oracle_forced_move
source: Forced — no alternatives to compare
ko: 강제 — 비교할 대안 없음
ru: Вынужденно — не с чем сравнивать

# oracle_memory
source: Memory
ko: 기억
ru: Память

# oracle_memory_off
source: Off — octogen forgets the history (human-like)
ko: 끔 — 옥토겐이 기록을 잊음 (사람처럼)
ru: Выкл — октоген забыл историю (как человек)

# oracle_memory_off_endgame
source: Exact endgame proofs need Memory on.
ko: 정확한 엔드게임 증명에는 기억이 켜져 있어야 합니다.
ru: Точные эндшпильные доказательства требуют включённой памяти.

# oracle_memory_on
source: On — octogen remembers the whole game
ko: 켬 — 옥토겐이 전체 게임을 기억
ru: Вкл — октоген помнит всю партию

# oracle_no_decision
source: No move to analyze yet
ko: 아직 분석할 수가 없습니다
ru: Пока нечего анализировать

# oracle_panel_title
source: Move Oracle
ko: 수 오라클
ru: Оракул хода

# oracle_played
source: played
ko: 실제 수
ru: сыграно

# oracle_pruned
source: not considered
ko: 고려 안 됨
ru: не рассмотрен

# oracle_pruned_tip
source: Octogen never sampled this move — it ranked below its consideration set.
ko: 옥토겐이 이 수를 표본으로 삼지 않았습니다 — 고려 대상에 들지 못했습니다.
ru: Октоген не пробовал этот ход — он не вошёл в число рассматриваемых.

# oracle_retry
source: Retry
ko: 다시 시도
ru: Повторить

# oracle_unavailable
source: Oracle failed to load
ko: 오라클을 불러오지 못했습니다
ru: Не удалось загрузить оракула

source: Pass
ko: 패스
ru: Перевожу

source: Password
ko: 비밀번호
ru: Пароль

source: Pause
ko: 일시정지
ru: Пауза

source: Pickup
ko: 가져가기
ru: Беру

source: Play
ko: 재생
ru: Воспроизвести

# playback_speed
source: Playback speed (× real timing)
ko: 재생 속도 (실제 시간 ×)
ru: Скорость воспроизведения (× реальное время)

source: Playing
ko: 게임 중
ru: В игре

source: Rating
ko: 레이팅
ru: Рейтинг

source: Ready
ko: 준비 완료
ru: Готов

source: Remove Bot
ko: 봇 제거
ru: Удалить бота

# replay_bout_next
source: Next bout
ko: 다음 판
ru: Следующий кон

# replay_bout_start
source: Start of bout
ko: 판 시작
ru: Начало кона

# replay_draw
source: Draw (press C)
ko: 그리기 (C 키)
ru: Рисовать (клавиша C)

# replay_draw_clear
source: Clear drawing (press C)
ko: 그림 지우기 (C 키)
ru: Стереть рисунок (клавиша C)

# replay_step_back
source: Step back
ko: 뒤로 한 단계
ru: Шаг назад

# replay_step_forward
source: Step forward
ko: 앞으로 한 단계
ru: Шаг вперёд

# replay_title
source: Replay
ko: 리플레이
ru: Повтор

# replay_unavailable
source: Replay code unavailable for this game
ko: 이 게임의 리플레이 코드를 사용할 수 없습니다
ru: Код повтора недоступен для этой игры

# result_fool
source: The fool
ko: 바보
ru: Дурак

# result_survived
source: Survived
ko: 생존
ru: Не дурак

# reveal_cards
source: Show all hands
ko: 모든 패 보기
ru: Показать все карты

source: Send
ko: 전송
ru: Отправить

source: Share Replay
ko: 리플레이 공유
ru: Поделиться повтором

source: Sign Up
ko: 가입
ru: Регистрация

source: Sign up failed
ko: 가입 실패
ru: Не удалось зарегистрироваться

source: Spectating
ko: 관전 중
ru: Наблюдение

# staleRoundReject
source: The round ended before your move landed — your card came back.
ko: 수가 도착하기 전에 라운드가 끝나 카드가 되돌아왔습니다.
ru: Раунд закончился раньше, чем прошёл ваш ход — карта вернулась.

source: Survival rate
ko: 생존율
ru: Процент выживания

# tab_all
source: All
ko: 전체
ru: Все

# tab_bots
source: Bots
ko: 봇
ru: Боты

# tab_humans
source: Humans
ko: 사람
ru: Люди

# times_fool
source: Times the fool
ko: 바보가 된 횟수
ru: Раз дураком

source: Trump
ko: 으뜸패
ru: Козырь

source: Type message...
ko: 메시지 입력...
ru: Введите сообщение...

source: Username
ko: 사용자 이름
ru: Имя пользователя

# username_reserved
source: That username is reserved. Usernames can’t contain the “%” symbol.
ko: 사용할 수 없는 사용자 이름입니다. 이름에 “%” 기호를 포함할 수 없습니다.
ru: Это имя пользователя зарезервировано. Имя не может содержать символ «%».

source: Waiting
ko: 대기 중
ru: Ожидание

source: Watch replay
ko: 리플레이 보기
ru: Смотреть повтор

source: Weak password
ko: 비밀번호가 너무 약합니다
ru: Слабый пароль

source: Winner
ko: 승자
ru: Победитель

# with_names_time
source: Names + timing
ko: 이름 + 시간
ru: Имена и время

source: You
ko: 나
ru: Вы

# your_stats
source: Your stats (listed games)
ko: 내 통계 (목록의 게임 기준)
ru: Ваша статистика (по списку игр)
